<h1>SQL</h1>
Pracuji s databází Northwind<br>
<a href="https://github.com/pthom/northwind_psql/blob/master/ER.png">Schéma databáze</a>

In [1]:
%config SqlMagic.style = '_DEPRECATED_DEFAULT'

In [2]:
%load_ext sql
%sql postgresql://postgres:{}@localhost:5432/northwind

In [3]:
%%sql
SELECT table_name AS name,
       table_type AS type
  FROM information_schema.tables
 WHERE table_schema = 'public' AND table_type IN ('BASE TABLE', 'VIEW')

 * postgresql://postgres:***@localhost:5432/northwind
15 rows affected.

[('territories', 'BASE TABLE'),
 ('order_details', 'BASE TABLE'),
 ('employee_territories', 'BASE TABLE'),
 ('us_states', 'BASE TABLE'),
 ('customers', 'BASE TABLE'),
 ('orders', 'BASE TABLE'),
 ('employees', 'BASE TABLE'),
 ('shippers', 'BASE TABLE'),
 ('products', 'BASE TABLE'),
 ('categories', 'BASE TABLE'),
 ('suppliers', 'BASE TABLE'),
 ('region', 'BASE TABLE'),
 ('customer_demographics', 'BASE TABLE'),
 ('customer_customer_demo', 'BASE TABLE'),
 ('monthly_total', 'VIEW')]

<h3>1. Změstnanci seřazeni podle prodeje</h3>

In [4]:
%%sql
WITH employee_sales AS(
SELECT e.employee_id, e.first_name, e.last_name, 
       SUM(od.unit_price * od.quantity * (1 - od.discount)) AS total
  FROM orders o
  JOIN order_details od
    ON o.order_id = od.order_id
  JOIN employees e
    ON o.employee_id = e.employee_id
 GROUP BY e.employee_id)

SELECT *, RANK() OVER(ORDER BY total DESC)
  FROM employee_sales;

 * postgresql://postgres:***@localhost:5432/northwind
9 rows affected.

[(4, 'Margaret', 'Peacock', 232890.84598203757, 1),
 (3, 'Janet', 'Leverling', 202812.84238787484, 2),
 (1, 'Nancy', 'Davolio', 192107.60465689204, 3),
 (2, 'Andrew', 'Fuller', 166537.75528742478, 4),
 (8, 'Laura', 'Callahan', 126862.2774778762, 5),
 (7, 'Robert', 'King', 124568.23485103557, 6),
 (9, 'Anne', 'Dodsworth', 77308.06623830303, 7),
 (6, 'Michael', 'Suyama', 73913.12937797053, 8),
 (5, 'Steven', 'Buchanan', 68792.28239394959, 9)]

<h3>2. Kumulativní měsíční obrat</h3>

In [5]:
%%sql
CREATE VIEW monthly_total AS(
SELECT DATE_TRUNC('month', o.order_date) AS month, 
   SUM(od.quantity * od.unit_price * (1 - od.discount))::numeric AS total
FROM orders o
JOIN order_details od
ON od.order_id = o.order_id
GROUP BY month);

 * postgresql://postgres:***@localhost:5432/northwind
(psycopg2.errors.DuplicateTable) relation "monthly_total" already exists

[SQL: CREATE VIEW monthly_total AS(
SELECT DATE_TRUNC('month', o.order_date) AS month,
   SUM(od.quantity * od.unit_price * (1 - od.discount))::numeric AS total
FROM orders o
JOIN order_details od
ON od.order_id = o.order_id
GROUP BY month);]
(Background on this error at: https://sqlalche.me/e/20/f405)

In [6]:
%%sql
SELECT *, SUM(total) OVER(ORDER BY month) AS running_total
  FROM monthly_total
 LIMIT 10;

 * postgresql://postgres:***@localhost:5432/northwind
10 rows affected.

[(datetime.datetime(1996, 7, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=7200))), Decimal('27861.8951296616'), Decimal('27861.8951296616')),
 (datetime.datetime(1996, 8, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=7200))), Decimal('25485.2750707433'), Decimal('53347.1702004049')),
 (datetime.datetime(1996, 9, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=7200))), Decimal('26381.4001325876'), Decimal('79728.5703329925')),
 (datetime.datetime(1996, 10, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=7200))), Decimal('37515.7249454789'), Decimal('117244.2952784714')),
 (datetime.datetime(1996, 11, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=3600))), Decimal('45600.045211137'), Decimal('162844.3404896084')),
 (datetime.datetime(1996, 12, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=3600))), Decimal('45239.6304932144'), Decimal('208083.9709828228')),
 (datetime.datetime(1997, 1, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=3600))), Decimal('61258.0701679784'), Decimal('269342.0411508012')),
 (datetime.datetime(1997, 2, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=3600))), Decimal('38483.6349503243'), Decimal('307825.6761011255')),
 (datetime.datetime(1997, 3, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=3600))), Decimal('38547.2201097268'), Decimal('346372.8962108523')),
 (datetime.datetime(1997, 4, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=7200))), Decimal('53032.9523889415'), Decimal('399405.8485997938'))]

<h3>3. Meziměsíční procentuální změna tržeb</h3>

In [7]:
%%sql
SELECT *, ROUND(((total / LAG(total) OVER(ORDER BY month)) - 1)*100, 2) ||  ' %''' AS pct_change
  FROM monthly_total
 LIMIT 10;

 * postgresql://postgres:***@localhost:5432/northwind
10 rows affected.

[(datetime.datetime(1996, 7, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=7200))), Decimal('27861.8951296616'), None),
 (datetime.datetime(1996, 8, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=7200))), Decimal('25485.2750707433'), "-8.53 %'"),
 (datetime.datetime(1996, 9, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=7200))), Decimal('26381.4001325876'), "3.52 %'"),
 (datetime.datetime(1996, 10, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=7200))), Decimal('37515.7249454789'), "42.21 %'"),
 (datetime.datetime(1996, 11, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=3600))), Decimal('45600.045211137'), "21.55 %'"),
 (datetime.datetime(1996, 12, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=3600))), Decimal('45239.6304932144'), "-0.79 %'"),
 (datetime.datetime(1997, 1, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=3600))), Decimal('61258.0701679784'), "35.41 %'"),
 (datetime.datetime(1997, 2, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=3600))), Decimal('38483.6349503243'), "-37.18 %'"),
 (datetime.datetime(1997, 3, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=3600))), Decimal('38547.2201097268'), "0.17 %'"),
 (datetime.datetime(1997, 4, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=7200))), Decimal('53032.9523889415'), "37.58 %'")]

<h3>4. Zákaznící s nadprůměrně velkými objednávkami</h3>

In [8]:
%%sql
WITH order_and_customer AS(
SELECT c.customer_id, c.company_name,
       (od.quantity * od.unit_price * (1 - od.discount))::numeric AS total
  FROM orders o
  JOIN order_details od
    ON od.order_id = o.order_id
  JOIN customers c
    ON c.customer_id = o.customer_id)

SELECT *,
  CASE
  WHEN total > AVG(total) OVER()
  THEN 'Above Average'
  ELSE 'Below Average'
   END  AS Average
  FROM order_and_customer
 ORDER BY total DESC
 LIMIT 10;

 * postgresql://postgres:***@localhost:5432/northwind
10 rows affected.

[('HANAR', 'Hanari Carnes', Decimal('15810'), 'Above Average'),
 ('QUICK', 'QUICK-Stop', Decimal('15019.4999882206'), 'Above Average'),
 ('SIMOB', 'Simons bistro', Decimal('10540.0001525879'), 'Above Average'),
 ('RATTC', 'Rattlesnake Canyon Grocery', Decimal('10540'), 'Above Average'),
 ('HUNGO', 'Hungry Owl All-Night Grocers', Decimal('9903.20007324219'), 'Above Average'),
 ('PICCO', 'Piccolo und mehr', Decimal('8432.00009065866'), 'Above Average'),
 ('MEREP', 'Mère Paillarde', Decimal('8263.36008884549'), 'Above Average'),
 ('KOENE', 'Königlich Essen', Decimal('7905'), 'Above Average'),
 ('QUICK', 'QUICK-Stop', Decimal('7905'), 'Above Average'),
 ('GREAL', 'Great Lakes Food Market', Decimal('7509.74999411032'), 'Above Average')]

<h4>4.5 Počet nadprůměrných objednávek každého zákazníka</h4>

In [9]:
%%sql
WITH order_and_customer AS(
SELECT c.customer_id, c.company_name,
       (od.quantity * od.unit_price * (1 - od.discount))::numeric AS total
  FROM orders o
  JOIN order_details od
    ON od.order_id = o.order_id
  JOIN customers c
    ON c.customer_id = o.customer_id),

order_and_average AS(
SELECT *,
  CASE
  WHEN total > (SELECT AVG(total)
                  FROM order_and_customer)
  THEN 'Above Average'
  ELSE 'Below Average'
   END  AS Average
  FROM order_and_customer
 ORDER BY total DESC)

SELECT customer_id, company_name, COUNT(*) above_average_orders
  FROM order_and_average
 WHERE average = 'Above Average'
 GROUP BY customer_id, company_name
 ORDER BY above_average_orders DESC
 LIMIT 10;

 * postgresql://postgres:***@localhost:5432/northwind
10 rows affected.

[('SAVEA', 'Save-a-lot Markets', 56),
 ('QUICK', 'QUICK-Stop', 52),
 ('ERNSH', 'Ernst Handel', 52),
 ('HUNGO', 'Hungry Owl All-Night Grocers', 25),
 ('RATTC', 'Rattlesnake Canyon Grocery', 20),
 ('FRANK', 'Frankenversand', 17),
 ('KOENE', 'Königlich Essen', 16),
 ('FOLKO', 'Folk och fä HB', 15),
 ('BOTTM', 'Bottom-Dollar Markets', 15),
 ('BONAP', "Bon app'", 15)]

<h3>5. Podíl obratu každé kategorie produktu</h3>

In [10]:
%%sql
WITH total_per_category AS(
SELECT c.category_id, c.category_name, 
       SUM(od.unit_price * od.quantity * (1 - od.discount))::numeric AS total
  FROM order_details od
  JOIN products p
    ON od.product_id = p.product_id
  JOIN categories c
    ON c.category_id = p.category_id
 GROUP BY c.category_id)

SELECT *, ROUND(total / SUM(total) OVER() * 100, 2) || ' %''' AS pct_of_total
  FROM total_per_category
 ORDER BY pct_of_total DESC;

 * postgresql://postgres:***@localhost:5432/northwind
8 rows affected.

[(2, 'Condiments', Decimal('106047.084609551'), "8.38 %'"),
 (7, 'Produce', Decimal('99984.5800735762'), "7.90 %'"),
 (5, 'Grains/Cereals', Decimal('95744.5873554382'), "7.56 %'"),
 (1, 'Beverages', Decimal('267868.179786248'), "21.16 %'"),
 (4, 'Dairy Products', Decimal('234507.284530578'), "18.53 %'"),
 (3, 'Confections', Decimal('167357.225473386'), "13.22 %'"),
 (6, 'Meat/Poultry', Decimal('163022.360268739'), "12.88 %'"),
 (8, 'Seafood', Decimal('131261.736555849'), "10.37 %'")]

<h3>6. 3 Nejvýkonnější produkty v každé kategorii</h3>

In [11]:
%%sql
WITH total_per_product AS(
SELECT c.category_id, p.product_id, p.product_name, c.category_name,
       SUM(od.unit_price * od.quantity * (1 - od.discount)::numeric) AS total
  FROM order_details od
  JOIN products p
    ON od.product_id = p.product_id
  JOIN categories c
    ON c.category_id = p.category_id
 GROUP BY p.product_id, c.category_id),

num_per_category AS(
SELECT *, ROW_NUMBER() OVER(PARTITION BY category_name ORDER BY total DESC)
  FROM total_per_product)

SELECT *
  FROM num_per_category
 WHERE row_number < 4;

 * postgresql://postgres:***@localhost:5432/northwind
24 rows affected.

[(1, 38, 'Côte de Blaye', 'Beverages', 141396.73562732543, 1),
 (1, 43, 'Ipoh Coffee', 'Beverages', 23526.699842727186, 2),
 (1, 2, 'Chang', 'Beverages', 16355.959905386866, 3),
 (2, 63, 'Vegie-spread', 'Condiments', 16701.0950472641, 1),
 (2, 61, "Sirop d'érable", 'Condiments', 14352.599874171618, 2),
 (2, 65, 'Louisiana Fiery Hot Pepper Sauce', 'Condiments', 13869.889445907103, 3),
 (3, 62, 'Tarte au sucre', 'Confections', 47234.96997850418, 1),
 (3, 20, "Sir Rodney's Marmalade", 'Confections', 22563.360295264425, 2),
 (3, 26, 'Gumbär Gummibärchen', 'Confections', 19849.144170827938, 3),
 (4, 59, 'Raclette Courdavault', 'Dairy Products', 71155.69990943, 1),
 (4, 60, 'Camembert Pierrot', 'Dairy Products', 46825.48029542655, 2),
 (4, 72, 'Mozzarella di Giovanni', 'Dairy Products', 24900.129391540293, 3),
 (5, 56, 'Gnocchi di nonna Alice', 'Grains/Cereals', 42593.0598222503, 1),
 (5, 64, 'Wimmers gute Semmelknödel', 'Grains/Cereals', 21957.96757586673, 2),
 (5, 42, 'Singaporean Hokkien Fried Mee', 'Grains/Cereals', 8574.999964818358, 3),
 (6, 29, 'Thüringer Rostbratwurst', 'Meat/Poultry', 80368.6724385033, 1),
 (6, 17, 'Alice Mutton', 'Meat/Poultry', 32698.380216373207, 2),
 (6, 53, 'Perth Pasties', 'Meat/Poultry', 20574.169932212237, 3),
 (7, 51, 'Manjimup Dried Apples', 'Produce', 41819.65024582073, 1),
 (7, 28, 'Rössle Sauerkraut', 'Produce', 25696.639789331555, 2),
 (7, 7, "Uncle Bob's Organic Dried Pears", 'Produce', 22044.29998782277, 3),
 (8, 18, 'Carnarvon Tigers', 'Seafood', 29171.874963399023, 1),
 (8, 10, 'Ikura', 'Seafood', 20867.33986927927, 2),
 (8, 40, 'Boston Crab Meat', 'Seafood', 17910.62964561701, 3)]